micropython/micropython/stmhal/cmsis/devinc/stm32f756xx.h
#define  RCC_PLLI2SCFGR_PLLI2SP              ((uint32_t)0x00030000)
#define  RCC_PLLI2SCFGR_PLLI2SP_0            ((uint32_t)0x00010000)
#define  RCC_PLLI2SCFGR_PLLI2SP_1            ((uint32_t)0x00020000)

#define  RCC_PLLI2SCFGR_PLLI2SQ              ((uint32_t)0x0F000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_0            ((uint32_t)0x01000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_1            ((uint32_t)0x02000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_2            ((uint32_t)0x04000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_3            ((uint32_t)0x08000000)

#define  RCC_PLLI2SCFGR_PLLI2SR              ((uint32_t)0x70000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_0            ((uint32_t)0x10000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_1            ((uint32_t)0x20000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_2            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_PLLSAICFGR register  ************/
#define  RCC_PLLSAICFGR_PLLSAIN              ((uint32_t)0x00007FC0)
#define  RCC_PLLSAICFGR_PLLSAIN_0            ((uint32_t)0x00000040)
#define  RCC_PLLSAICFGR_PLLSAIN_1            ((uint32_t)0x00000080)
#define  RCC_PLLSAICFGR_PLLSAIN_2            ((uint32_t)0x00000100)
#define  RCC_PLLSAICFGR_PLLSAIN_3            ((uint32_t)0x00000200)
#define  RCC_PLLSAICFGR_PLLSAIN_4            ((uint32_t)0x00000400)
#define  RCC_PLLSAICFGR_PLLSAIN_5            ((uint32_t)0x00000800)
#define  RCC_PLLSAICFGR_PLLSAIN_6            ((uint32_t)0x00001000)
#define  RCC_PLLSAICFGR_PLLSAIN_7            ((uint32_t)0x00002000)
#define  RCC_PLLSAICFGR_PLLSAIN_8            ((uint32_t)0x00004000)

#define  RCC_PLLSAICFGR_PLLSAIP              ((uint32_t)0x00030000)
#define  RCC_PLLSAICFGR_PLLSAIP_0            ((uint32_t)0x00010000)
#define  RCC_PLLSAICFGR_PLLSAIP_1            ((uint32_t)0x00020000)

#define  RCC_PLLSAICFGR_PLLSAIQ              ((uint32_t)0x0F000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_0            ((uint32_t)0x01000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_1            ((uint32_t)0x02000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_2            ((uint32_t)0x04000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_3            ((uint32_t)0x08000000)

#define  RCC_PLLSAICFGR_PLLSAIR              ((uint32_t)0x70000000)
#define  RCC_PLLSAICFGR_PLLSAIR_0            ((uint32_t)0x10000000)
#define  RCC_PLLSAICFGR_PLLSAIR_1            ((uint32_t)0x20000000)
#define  RCC_PLLSAICFGR_PLLSAIR_2            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_DCKCFGR1 register  ***************/
#define  RCC_DCKCFGR1_PLLI2SDIVQ              ((uint32_t)0x0000001F)
#define  RCC_DCKCFGR1_PLLI2SDIVQ_0            ((uint32_t)0x00000001)
#define  RCC_DCKCFGR1_PLLI2SDIVQ_1            ((uint32_t)0x00000002)
#define  RCC_DCKCFGR1_PLLI2SDIVQ_2            ((uint32_t)0x00000004)
#define  RCC_DCKCFGR1_PLLI2SDIVQ_3            ((uint32_t)0x00000008)
#define  RCC_DCKCFGR1_PLLI2SDIVQ_4            ((uint32_t)0x00000010)

#define  RCC_DCKCFGR1_PLLSAIDIVQ              ((uint32_t)0x00001F00)
#define  RCC_DCKCFGR1_PLLSAIDIVQ_0            ((uint32_t)0x00000100)
#define  RCC_DCKCFGR1_PLLSAIDIVQ_1            ((uint32_t)0x00000200)
#define  RCC_DCKCFGR1_PLLSAIDIVQ_2            ((uint32_t)0x00000400)
#define  RCC_DCKCFGR1_PLLSAIDIVQ_3            ((uint32_t)0x00000800)
#define  RCC_DCKCFGR1_PLLSAIDIVQ_4            ((uint32_t)0x00001000)

#define  RCC_DCKCFGR1_PLLSAIDIVR              ((uint32_t)0x00030000)
#define  RCC_DCKCFGR1_PLLSAIDIVR_0            ((uint32_t)0x00010000)
#define  RCC_DCKCFGR1_PLLSAIDIVR_1            ((uint32_t)0x00020000)

#define  RCC_DCKCFGR1_SAI1SEL                 ((uint32_t)0x00300000)
#define  RCC_DCKCFGR1_SAI1SEL_0               ((uint32_t)0x00100000)
#define  RCC_DCKCFGR1_SAI1SEL_1               ((uint32_t)0x00200000)

#define  RCC_DCKCFGR1_SAI2SEL                 ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR1_SAI2SEL_0               ((uint32_t)0x00400000)
#define  RCC_DCKCFGR1_SAI2SEL_1               ((uint32_t)0x00800000)

#define  RCC_DCKCFGR1_TIMPRE                  ((uint32_t)0x01000000)

/********************  Bit definition for RCC_DCKCFGR2 register  ***************/
#define  RCC_DCKCFGR2_USART1SEL              ((uint32_t)0x00000003)
#define  RCC_DCKCFGR2_USART1SEL_0            ((uint32_t)0x00000001)
#define  RCC_DCKCFGR2_USART1SEL_1            ((uint32_t)0x00000002)
#define  RCC_DCKCFGR2_USART2SEL              ((uint32_t)0x0000000C)
#define  RCC_DCKCFGR2_USART2SEL_0            ((uint32_t)0x00000004)
#define  RCC_DCKCFGR2_USART2SEL_1            ((uint32_t)0x00000008)
#define  RCC_DCKCFGR2_USART3SEL              ((uint32_t)0x00000030)
#define  RCC_DCKCFGR2_USART3SEL_0            ((uint32_t)0x00000010)
#define  RCC_DCKCFGR2_USART3SEL_1            ((uint32_t)0x00000020)
#define  RCC_DCKCFGR2_UART4SEL               ((uint32_t)0x000000C0)
#define  RCC_DCKCFGR2_UART4SEL_0             ((uint32_t)0x00000040)
#define  RCC_DCKCFGR2_UART4SEL_1             ((uint32_t)0x00000080)
#define  RCC_DCKCFGR2_UART5SEL               ((uint32_t)0x00000300)
#define  RCC_DCKCFGR2_UART5SEL_0             ((uint32_t)0x00000100)
#define  RCC_DCKCFGR2_UART5SEL_1             ((uint32_t)0x00000200)
#define  RCC_DCKCFGR2_USART6SEL              ((uint32_t)0x00000C00)
#define  RCC_DCKCFGR2_USART6SEL_0            ((uint32_t)0x00000400)
#define  RCC_DCKCFGR2_USART6SEL_1            ((uint32_t)0x00000800)
#define  RCC_DCKCFGR2_UART7SEL               ((uint32_t)0x00003000)
#define  RCC_DCKCFGR2_UART7SEL_0             ((uint32_t)0x00001000)
#define  RCC_DCKCFGR2_UART7SEL_1             ((uint32_t)0x00002000)
#define  RCC_DCKCFGR2_UART8SEL               ((uint32_t)0x0000C000)
#define  RCC_DCKCFGR2_UART8SEL_0             ((uint32_t)0x00004000)
#define  RCC_DCKCFGR2_UART8SEL_1             ((uint32_t)0x00008000)
#define  RCC_DCKCFGR2_I2C1SEL                ((uint32_t)0x00030000)
#define  RCC_DCKCFGR2_I2C1SEL_0              ((uint32_t)0x00010000)
#define  RCC_DCKCFGR2_I2C1SEL_1              ((uint32_t)0x00020000)
#define  RCC_DCKCFGR2_I2C2SEL                ((uint32_t)0x000C0000)
#define  RCC_DCKCFGR2_I2C2SEL_0              ((uint32_t)0x00040000)
#define  RCC_DCKCFGR2_I2C2SEL_1              ((uint32_t)0x00080000)
#define  RCC_DCKCFGR2_I2C3SEL                ((uint32_t)0x00300000)
#define  RCC_DCKCFGR2_I2C3SEL_0              ((uint32_t)0x00100000)
#define  RCC_DCKCFGR2_I2C3SEL_1              ((uint32_t)0x00200000)
#define  RCC_DCKCFGR2_I2C4SEL                ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR2_I2C4SEL_0              ((uint32_t)0x00400000)
#define  RCC_DCKCFGR2_I2C4SEL_1              ((uint32_t)0x00800000)
#define  RCC_DCKCFGR2_LPTIM1SEL              ((uint32_t)0x03000000)
#define  RCC_DCKCFGR2_LPTIM1SEL_0            ((uint32_t)0x01000000)
#define  RCC_DCKCFGR2_LPTIM1SEL_1            ((uint32_t)0x02000000)
#define  RCC_DCKCFGR2_CECSEL                 ((uint32_t)0x04000000)
#define  RCC_DCKCFGR2_CK48MSEL               ((uint32_t)0x08000000)
#define  RCC_DCKCFGR2_SDMMC1SEL              ((uint32_t)0x10000000)

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ((uint32_t)0x00000004)
#define RNG_CR_IE                            ((uint32_t)0x00000008)

